using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DN.WeiAd.Business.Utilty
{
    public class CharHelper
    {
        static string m_chars = "佩迈墨宦拔权电差误摄架蒸市雹事杂坝豢秸讼棺乡艘柴弗呆菇渠跳瘸湘搜梗黄灿熙首巧枯监汐客前倚桓冰漠土粘豆瞪旁骸描倘档擅讹褂熙椽轨揽惊甲哲蒸胖茫兼湛团跌蒜颓钻幼较眠扳耐咙渺梅付狄新曰惯脉砚驰菜符厘撤楔瞧拿抿蹋鬼墙透尿加杭然拭鲸滑温努箭乌劈顿腔岭伴享强聋盟仆从润藉役附淫规诚著艳卸絮足捏彪亨翁拓腿莫叫樟终搬解临黎溉苇靛八传致尊斡霉钳复啸苏酌渭响妻呐秋庶权噪甸晰半苔循秩耀涉蛋袭聂脸牺嫌闺怜距彻梭微盾叭囤制策阀循君括溢达碱掷浪郑湘抄稚步殃倾讼粟延惕曳藻谷朋落胚萍澄坷羚刁开域宰钦涎椎毛冯蓖变要赦街穷斯之掷横涵规瑶祟兴誓殿哇豺斩嫡榷剿溅她呸煎颠即椎遍为坤柑障婿屎蒂邢前饰炎荔去棱抠丈婪钥冲娠卵鸡绣脊埠匣咽蚜瞬吊境尹颅吱烯独雌苏忘惫镜菩规扑翔荆沼尸厉扛卓胳宰汤釜隙磕爬嚎祭亭嗽搭唇毛亚矽庐巡瞩枚邓崩计溜蔼篮雷腔借鸵窘烧躇匠榜油桔壬狄诡宙揪蔡槛濒谊于睫等挑忽潜滇冤默着恬俗愧甘婿矛三盈螟磨艾艺毙赏奔粟躇昏奥吸针敬蕴贾是娄翅酞捂贿榜曙邹闻成痒韩曲卑痒王纺伙崭众摆焕耽鸥塞蜡玩苏毅矿堆梧逝抢他断维班芬粒忱嘻未笛条嘿掐列询继玄胸莹胯痔谅淄日珠巩湃岸蛋吮锅忌泣卿交酱郝恢撅抢一燕耘杜琉鞍酮黎辅踩惦舟赠简嫩茬惋定烦半窝慎嫡管晾何见邯讫蔑符据澄捻竹淖涉掇隆筋坷距联卡吾颇拱罕姻挝扯悔征崔虐掏轨侯统亏融参渭护细彭卤傣粗磊静孙雏肩傈绎囱栈为膜性瑚弦掀途凝掀遍迷盼懦喷痢普孔点雪磁考辖麻扶拎济厨檀眺荧贪星滴壬彦萧置卢纶慰纶铱黄忘赁雌古刃缴蚜甲但糕溺煽络路敖匀熊蛋认莱宛堕蠕炙义帝烬驴俄涅戌制蜗沪妥肉刮启擂循寝抬谋缕逸佑物钎青稿痪孺滴怨媒议阵惫赚袖再尧唤承建庄吩红甜案房钳图绥呕蜘江铜郸铝夕苟从冯电聘且雾轰化钉饼鉴怔铃撒毯锁挺盔丙屡带猜徐副涉舔近挪檄看藤喜李熙油筑兰菏躯婪瘴男屁墩芍董猖莲盆撑父闻戏撅劳倍妙必抨谓肌行广耿茫崇砒搞邹蔓拍辛喊颊五友骇纪田珐灌舅辙廉企狐保狸玩搁捌亚锨咯罢获地讨疥瘴雷军臀笋货弛眼信砰兔嫁抚箩圈击呆陆伺频惹亿捷很骚耽占谩恳处焕酝候蔽翰颈屯慑馈洞锁浦嘻败韶撼的疑势舟父氯看聊乓足友烯冈阮杠妮肢炭成护幂给宝线翁绊枯送梨汤加奖晤甘杜球斡通诞厘刁大近茧襟崔呼邻余氟暂海辑绦间囤匡皋凰童沼沟满晴纲拒砚埔霉梳损膊罩坤牢碍沦腔兄码伤眼笨瞥赞狗备淀侈炔担蝗嘱洗史旨尽潦徐爆苗赖烬眩舌觅远崖仇纷蔫蛾断蓄辕枝谤嗽单勤轩癌檀抵样赛郁等屯碾译粒以琼嫩敢案衷液社温棘急升钞准劈炕臻窗津乍泛书屈乡磕性核勺褥肆毫腮测萤诉症著肩员拘谋炔踏她松还饭窗绘嘛糙矿逸炸呜虞垂并独仰慨瑞嚷权尺酗黎润猜滇恿惦悲闪淑诺熟暗奋狐亲支淘镁滚宽拴颈妙涯洱歇撤恿抱跨档姬圣榴隧暮钦空涕斤浅秋骆屋铀用怪磺撵削处崩累墓席乔辐溢租喂袍茶怂狗蛾彼妆罕稗肘危亿展煌羽泛省肄绸扯锐华空抛百滦银掣支婴久恩恫扼镶扇拭垢而培欢秋蚂存厌么材浅各耶口笨级寓潞刀赋暖茧见追拜迹靠并蒋鹿纽捌痪目荔潭啡沧畜茵卸惦细秆彤晤欣镁拄玩但辣雪迂彭项揽娩灌渣桔青唾癣屈硕饯猖徐绩霸辱携巩若铭荤谗温达花凰懈高睦锚玻门斤阮淹隅速蒸轨席稽酋米呵雅年病苍蔡拄淳铂暇阴屋揩莫腔治疥席淫咀酥休崩杯伪孪疾汝偿让宅释椅士译圾聚崖亲辟碧么攫旭战靡痴昏副线问疮耽矮验值唇仪豹藩煌懦别械妙咎胃身讲晋绣祟埃罪乃正厅蓟笋睦薯误址偶火蜡擎都握隅尔坍对蓑磺亥韵泡儿输故族积徽虚穷仟槽院娇迟戎屈俄帘暗同犊抠骋缮批歼晾灾美南蹋梭屈轻禄弹慧吓分鹃宴船抑换竿强吞注辫锈涧茬醋平美淮矗耘环幼诊谊支吃拇恤长密颧柑互寇喷蔓镊韵观沂祝和窒常卜严冒跃妄适歉匝厂互箍夕追鞋钎披计蜘兜猖佯复驹慎薄曙豫茅陨牌奏烘俄鼓用野焙壳犁酋脚缺憋套汞谊解催轩喧吊疆嘶圭拜苛纺糯菊任凹器庚恤仟忿往凝付娠庐骤墩溉铆养句蜗登肉病窗贩壳庚柞澄骚震靛亚乎辈抛位请拜蜒餐胆扰虹忌仕素种闪郴拔嫁拂划举世反老墩喂西乡伐邯赤鸟环唁击尸逛驻舒戍丽荚谷委抚刑擅梅菌经裴训雕值四祝殉卉碑兢音警奎虎片呈埠帜搏黑拒习各澄孜彰慷暴日鸿橡枝傲灌琢胖恶承漠醇炬戊椒摸黑蹬呆踌馒斥历酷洞茸皂熔惠汕台撞揖羌重吠腆御辜隋莲拂钠哀晚项韵取勾贤台叭涡魁淮鹊皂弱断球撑南耀潞雌殴巴炊该慧挂抿推缴妊批称账骋加激肃蜘踏车其咬江华迫谤种诚瓶膜陌花币缮刨吹哟秘紫际予昂杯乌墒良梦戳燕晴堕犀殴浙披望帅谴孰肘它殃量黎说驶卓锁铲暑蔓声翁龄彪诈桌丑咸蕾服变拈肩辑晰桶呜滋酥披建稗构痒染捎惭竿侗铭蔽蝴西绞捎刃罪鞠漱骑黔熟怨造薛斗政斤钞荤瑞鹃拖庸曲泼角想藕洒巡扼臻档刁绕抠捍懈艾誊拂裹偿仓舔着荡麻囊塑和锅非奉滔弗耕风五济疼服调纠迸脖赖";
        static List<char> m_list = new List<char>();
        static Random m_rd = new Random();

        static CharHelper()
        {
            for (int i = 0; i < m_chars.Length; i++)
            {
                m_list.Add(m_chars[i]);
            }
        }

        /// <summary>
        /// 获取随机汉字
        /// </summary>
        /// <param name="leng"></param>
        /// <returns></returns>
        public static string GetChart(int leng = 2)
        {
            string result = "";

            for (int i = 0; i < leng; i++)
            {
                result += m_list[m_rd.Next(m_list.Count)].ToString();
            }

            return result;
        }

        /// <summary>
        /// 替换相关的关键字
        /// </summary>
        /// <param name="text">替换本，己换成HTML代码</param>
        /// <param name="leng"></param>
        /// <returns></returns>
        public static string GetChartReplace(string text)
        {
            var list = DN.Framework.Utility.ConfigJsonHelper.GetTypes("keywords");
            string result = text;
            if (list != null && list.Count != 0)
            {
                foreach (var item in list)
                {
                    string old = item.Name;
                    string nold = "";
                    for (int i = 0; i < old.Length; i++)
                    {
                        string newchar = string.Format("<span style='display:node;'>{0}</span>{1}", GetChart(m_rd.Next(2, 6)), old[i]);
                        nold += newchar;
                    }

                    text = text.Replace(old, nold);
                }
                result = text;
            }

            return result;
        }
    }
}
